In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import os
import sklearn

In [4]:
os.listdir("datos")

['books_data.csv',
 'dataimputar.csv',
 'ecommerce_data.csv',
 'ecommerce_export.csv',
 'ejemplo_data.csv',
 'ratings_data.csv']

In [41]:
df1 = pd.read_csv("datos/ejemplo_data.csv")

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           5 non-null      int32
 1   Nombre       5 non-null      object
 2   2016         5 non-null      float64
 3   2017         5 non-null      object
 4   Crecimiento  5 non-null      object
 5   Unidades     5 non-null      int32
 6   fecha        5 non-null      object
 7   Activo       5 non-null      bool
dtypes: bool(1), float64(1), int32(2), object(4)
memory usage: 377.0+ bytes

imputación y similares

1.2.) Transformar variables. Como en Unidad hay un "no" que no se puede transformar, lo reemplazo por un 0 y todos felices.

In [43]:
df1['Unidades']=df1['Unidades'].replace({"No":0})

#Como voy a tener que eliminar el $ y la ,. Es mejor usar una regex para ahorrar líneas. Podría encadenar el astype luego, pero eso sería volar demasiado cerca del sol.

df1['2016']=df1['2016'].str.replace(r"[$,]", "", regex=True)


df1['ID']=df1['ID'].astype("int")
df1['Activo']=df1['Activo'].astype("bool")
df1['Unidades']=df1['Unidades'].astype("int")
df1['2016']=df1['2016'].astype("float")

2. Lectura y análisisexploratorio de datos.

2.1. Cargar la base de datos de nombre "ecommerce data.csv".
2.2. Identifique los tipos de variables que hay disponibles en la base de datos (df.types o df.info()

In [54]:
df2= pd.read_csv("datos/ecommerce_data.csv", encoding='latin-1')

#no funciona el utf-8, así que pruebo con latin-1

In [56]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  int32
 1   StockCode    541909 non-null  object
 2   Description  541909 non-null  object
 3   Quantity     541909 non-null  int32
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int32(2), object(4)
memory usage: 28.9+ MB

convertir variables:
•Utilizando la funci´on astype transforme el atributo "InvoiceNo" a entero y el atributo "Description"a string. Vuelva a consultar el estado de las variables.
•Convierta el atributo "Quantity" a entero y "UnitPrice" a flotante.
•La columna "InvoiceDate" contiene un string que representa "fecha-hora", separe la columna endos columnas que representen cada atributo por separado.

In [55]:
#InvoiceNo tiene una C en algún lado. Para evitarme problemas con otras letras puedo usar una regex que e elimine todo l oque no sea número. Eso la deja lista para el astype a entero.
df2['InvoiceNo']=df2['InvoiceNo'].str.replace(r"\D", "", regex=True)


df2['InvoiceNo']=df2['InvoiceNo'].astype("int")
df2['Description']=df2['Description'].astype("str")
df2['Quantity']=df2['Quantity'].astype("int")
df2['UnitPrice']=df2['UnitPrice'].astype("float")

In [58]:
df2[['Fecha', 'Hora']]=df2['InvoiceDate'].str.split(" ", n=1, expand=True)

In [ ]:
#Podemos mirar las columnas de la base para ver que tal. Ls instrucciones no dicen que borremos la columna original, aíque la dejo por ahora.

df2[['InvoiceDate', 'Fecha', 'Hora']].tail(15)

            InvoiceDate      Fecha   Hora
541894  12/9/2011 12:50  12/9/2011  12:50
541895  12/9/2011 12:50  12/9/2011  12:50
541896  12/9/2011 12:50  12/9/2011  12:50
541897  12/9/2011 12:50  12/9/2011  12:50
541898  12/9/2011 12:50  12/9/2011  12:50
541899  12/9/2011 12:50  12/9/2011  12:50
541900  12/9/2011 12:50  12/9/2011  12:50
541901  12/9/2011 12:50  12/9/2011  12:50
541902  12/9/2011 12:50  12/9/2011  12:50
541903  12/9/2011 12:50  12/9/2011  12:50
541904  12/9/2011 12:50  12/9/2011  12:50
541905  12/9/2011 12:50  12/9/2011  12:50
541906  12/9/2011 12:50  12/9/2011  12:50
541907  12/9/2011 12:50  12/9/2011  12:50
541908  12/9/2011 12:50  12/9/2011  12:50

In [63]:
df2['Total']=df2['Quantity'] * df2['UnitPrice']

df2[['UnitPrice', 'Quantity', 'Total']].head(15)

    UnitPrice  Quantity  Total
0        2.55         6  15.30
1        3.39         6  20.34
2        2.75         8  22.00
3        3.39         6  20.34
4        3.39         6  20.34
5        7.65         2  15.30
6        4.25         6  25.50
7        1.85         6  11.10
8        1.85         6  11.10
9        1.69        32  54.08
10       2.10         6  12.60
11       2.10         6  12.60
12       3.75         8  30.00
13       1.65         6   9.90
14       4.25         6  25.50

In [64]:
df2.to_csv("base_trabajada.csv")

2.3. Estadísticas descriptivas:

•Crear un diccionario con 50 datos que contenga al menos tres atributos continuos.
•Transforme dicho diccionario a un dataFrame de Pandas.
•Obtenga estad´ısticas descriptivas de tendencia central.
•Obtenga estad´ısticas descriptivas de dispersi´on.

In [66]:
animales = ['Caballo', 'Gato', 'Oveja', 'Mapache', 'Elefante']

diccionario_animales = {'Animal': np.random.choice(animales, 50), "Carisma": np.random.randint(1, 10, 50), "Belleza": np.random.randint(1, 10, 50), "Dulzura": np.random.randint(1, 10, 50), "Ingenio": np.random.randint(1, 10, 50)}

df3=pd.DataFrame(diccionario_animales)

In [68]:
df3['Animal'].value_counts()

Animal
Elefante    15
Mapache     12
Gato         9
Caballo      7
Oveja        7
Name: count, dtype: int64

Medidas

In [70]:
df3.describe()

         Carisma    Belleza    Dulzura    Ingenio
count  50.000000  50.000000  50.000000  50.000000
mean    5.200000   5.280000   4.840000   4.700000
std     2.813959   2.733317   2.469074   2.612763
min     1.000000   1.000000   1.000000   1.000000
25%     2.250000   3.000000   3.000000   3.000000
50%     6.000000   5.000000   5.000000   5.000000
75%     8.000000   8.000000   7.000000   6.750000
max     9.000000   9.000000   9.000000   9.000000

Imputación y similares

In [16]:
#Problema con separador, es punto y coma en lugar de coma.

df4=pd.read_csv("datos/books_data.csv", sep=";", encoding = "latin-1")

#Este no tiene problemas con separador, pero mantiene lo del encoding.
df5= pd.read_csv("datos/ratings_data.csv", encoding = "latin-1")

In [18]:
df5.head(15)

    Unnamed: 0  User-ID        ISBN  Book-Rating  MeanRating
0            0   276725  034545104X            0    2.933333
1            1   276726  0155061224            5    2.500000
2            2   276727  0446520802            0    4.060345
3            3   276729  052165615X            3    3.000000
4            4   276729  0521795028            6    6.000000
5            5   276733  2080674722            0    3.666667
6            6   276736  3257224281            8    5.400000
7            7   276737  0600570967            6    6.000000
8            8   276744  038550120X            7    3.336957
9            9   276745   342310538           10    5.000000
10          10   276746  0425115801            0    2.529851
11          11   276746  0449006522            0    3.504505
12          12   276746  0553561618            0    2.153285
13          13   276746  055356451X            0    2.623529
14          14   276746  0786013990            0    3.285714

In [19]:
df5.isnull().sum()

Unnamed: 0     0
User-ID        0
ISBN           0
Book-Rating    0
MeanRating     0
dtype: int64

In [20]:
df_consolidada=df4.merge(right=df5, on='ISBN')

In [22]:
df_consolidada.to_csv("base libros consolidada.csv")